{
  "greeting": "Olá! Meu nome é",
  "saudacaoInicial": "Sou uma desenvolvedora de software movida por criar soluções inovadoras e eficientes. Meu objetivo é transformar ideias em realidade através do código, construindo aplicações que impactam positivamente a vida das pessoas. Navegue pelo meu portfólio para conhecer meus projetos e habilidades.",
  "aboutMe": "Sobre mim",
  "sejaBemVindo": "Seja muito bem-vindo(a) ao meu portfólio. Conheça a minha trajetória:",
  "minhaTragetoria": "anos de experiência com desenvolvimento de software. A capacidade de construir algo funcional e belo a partir do zero é o que me move como desenvolvedora de software. Minha jornada profissional tem sido focada no desenvolvimento de aplicações web robustas e escaláveis, sempre com o compromisso de entregar a melhor experiência para o usuário final.Acredito que a colaboração e a comunicação são tão importantes quanto um código bem escrito. Por isso, em meus projetos, busco sempre entender a fundo o problema a ser resolvido, trabalhando de forma ágil e em sintonia com a equipe. Sou uma entusiasta de boas práticas de desenvolvimento, como código limpo e testes automatizados, pois entendo que a qualidade do software é fundamental para o seu sucesso a longo prazo.",
  "desenvolvimentoFrontendModerno": "Desenvolvimento Front-End Moderno",
  "arquiteturaBackend": "Arquitetura de Back-End e APIs",
  "resolucaoProblemas": "Resolução de Problemas e Arquitetura de Software",
  "tenhoAbordagemAnalitica": "Tenho uma abordagem analítica para decompor problemas complexos e projetar soluções de software limpas, eficientes e escaláveis. Valorizo o código bem estruturado, a aplicação de design patterns e a colaboração para construir produtos de alta qualidade.",
  "desenvolvoLogicaServidor": "Desenvolvo a lógica de servidor, a segurança e a infraestrutura que sustentam as aplicações. Sou proficiente na construção de APIs REST robustas e escaláveis utilizando Java.",
  "crioInterfaces": "Crio interfaces de usuário fluidas e responsivas com foco na experiência do usuário (UX). Tenho sólida experiência React.js, transformando designs complexos em componentes reutilizáveis e performáticos.",
  "comunicacaoColaboracaoAgil": "Comunicação e Colaboração Ágil",
  "comunicacaoClaraBase": "Acredito que a comunicação clara é a base para o sucesso de um projeto. Atuo de forma colaborativa em equipes multidisciplinares (desenvolvedores, designers, PMs), utilizando metodologias ágeis para alinhar objetivos técnicos com as metas de negócio e entregar valor contínuo."
}
